dmagill89/STM32/UCSD-Embedded-C-Final-Assignment-David-Magill/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32l4xx_ll_utils.h"
#include "stm32l4xx_ll_gpio.h"

#include <stdio.h>
#include <stdbool.h>

#include "stm32l475e_iot01.h"
#include "stm32l475e_iot01_tsensor.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
DFSDM_Channel_HandleTypeDef hdfsdm1_channel1;

I2C_HandleTypeDef hi2c2;

QSPI_HandleTypeDef hqspi;

SPI_HandleTypeDef hspi3;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart3;

PCD_HandleTypeDef hpcd_USB_OTG_FS;

/* USER CODE BEGIN PV */
volatile int demoCount = 0;
bool demoOneShown = false;
bool demoTwoShown = false;
bool demoThreeShown = false;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DFSDM1_Init(void);
static void MX_I2C2_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_SPI3_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_USB_OTG_FS_PCD_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */


  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DFSDM1_Init();
  MX_I2C2_Init();
  MX_QUADSPI_Init();
  MX_SPI3_Init();
  MX_USART1_UART_Init();
  MX_USART3_UART_Init();
  MX_USB_OTG_FS_PCD_Init();
  /* USER CODE BEGIN 2 */
  BSP_TSENSOR_Init();

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  char finalAssignmentMessage[] = "Final Assignment\r";
  HAL_UART_Transmit(&huart1, (uint8_t *) finalAssignmentMessage, sizeof(finalAssignmentMessage), HAL_MAX_DELAY);

  while (1)
  {


	if (demoCount == 0) {

		if (!demoOneShown) {
			uint32_t flash = LL_GetFlashSize();
			uint32_t uuidParts[3];
			char demoOneBuffer[69] = {0};

			uuidParts[0] = LL_GetUID_Word0();
			uuidParts[1] = LL_GetUID_Word1();
			uuidParts[2] = LL_GetUID_Word2();

			sprintf(demoOneBuffer, "\n\nDemo 1: LL APIs\rFlash Size: %lu\rUUID: %lu-%lu-%lu\r\n", flash, uuidParts[0], uuidParts[1], uuidParts[2]);
			HAL_UART_Transmit(&huart1, (uint8_t *) demoOneBuffer, sizeof(demoOneBuffer), 1000);

			demoOneShown = true;
		}

		LL_GPIO_TogglePin(LED2_GPIO_Port, LED2_Pin);
		HAL_Delay(1000);
	}

	if (demoCount == 1) {

		if (!demoTwoShown) {
			uint32_t deviceId = HAL_GetDEVID();
			uint32_t uidParts[3];
			char demoTwoBuffer[69] = {0};

			uidParts[0] = HAL_GetUIDw0();
			uidParts[1] = HAL_GetUIDw1();
			uidParts[2] = HAL_GetUIDw2();

			sprintf(demoTwoBuffer, "\n\nDemo 2: HAL APIs\rDevice ID: %lu\rUID: %lu-%lu-%lu\r\n", deviceId, uidParts[0], uidParts[1], uidParts[2]);
			HAL_UART_Transmit(&huart1, (uint8_t *) demoTwoBuffer, sizeof(demoTwoBuffer), 1000);

			demoTwoShown = true;
		}

		HAL_GPIO_TogglePin(GPIOB, LED2_Pin);
		HAL_Delay(2000);
	}

	if (demoCount == 2) {

		if (!demoThreeShown) {
			float temp = BSP_TSENSOR_ReadTemp();
			char demoThreeBuffer[45] = {0};

			sprintf(demoThreeBuffer, "\n\nDemo 3: BSP APIs\rTemperature: %f\r", temp);
			HAL_UART_Transmit(&huart1, (uint8_t *) demoThreeBuffer, sizeof(demoThreeBuffer), 1000);

			demoThreeShown = true;
		}

		BSP_LED_On(LED2);
		HAL_Delay(3000);
		BSP_LED_Off(LED2);
		HAL_Delay(3000);
	}
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Configure LSE Drive Capability
  */
  HAL_PWR_EnableBkUpAccess();
  __HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);
  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSE|RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.LSEState = RCC_LSE_ON;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 40;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

